tutorials/staticBubble_mod/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    right
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    left
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    back
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    front
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    topAndBottom
    {
        type            empty;
    }

}

// ************************************************************************* //
