tutorials/staticBubble_mod/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     sclsVOFFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         0.5;

deltaT          1e-03;

writeControl    adjustableRunTime;

writeInterval   0.05;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           1;
maxAlphaCo      1;

maxDeltaT       1;


functions
{
    minMax
    {
        type        fieldMinMax;
        libs        ("libfieldFunctionObjects.so");
        fields
        (
            U
        );
        location        no;
        writeControl    timeStep;
        writeInterval   1;
        timeStart       0.2;
    }
    probes
    {
        type        probes;
        libs        ("libsampling.so");
        fields
        (
            p_rgh
        );
        probeLocations
        (
           (0.025 0.025 0)
        );
        writeControl    timeStep;
        writeInterval   1;
        timeStart       0.2;
    }
}

// ************************************************************************* //
